<template><div><h2 id="_6-1-图的基本概念" tabindex="-1"><a class="header-anchor" href="#_6-1-图的基本概念" aria-hidden="true">#</a> 6.1 图的基本概念</h2>
<h3 id="图的定义" tabindex="-1"><a class="header-anchor" href="#图的定义" aria-hidden="true">#</a> 图的定义</h3>
<ul>
<li>有向图</li>
<li>无向图</li>
<li>简单图</li>
<li>多重图</li>
<li>完全图 / 简单完全图</li>
<li>子图</li>
<li>连通、连通图和连通分量</li>
<li>强连通图、强连通分量</li>
<li>生成树</li>
<li>生成森林</li>
<li>顶点的度、入度和出度</li>
<li>边的权和网</li>
<li>稠密图、稀疏图</li>
<li>路径、路径长度和回路</li>
<li>简单路径、简单回路</li>
<li>距离</li>
<li>有向树</li>
</ul>
<!-- ### 习题

#### 4【2011】下列关于图的叙述中，正确的是（）

① 回路是简单路径
② 存储稀疏图，用邻接矩阵比邻接表更省空间
③ 若有向图中存在拓扑序列，则该图不存在回路 → 仅 ③，① 错：回路对应路径，简单回路对应简单路径

- 6【2009
- 7【2010】
- 9【2013】

#### 15【2017】

#### 16 设有无向图 G=(V, E)和 G'(V', E')，若 G'是 G 的生成树，则下列不正确的是

① G'为 G 的连通分量
② G'为 G 的无环子图
③ G'为 G 的极小连通子图且 V'=V→ 只有 ① -->
</div></template>
