<template><div><h2 id="_8-4-选择排序" tabindex="-1"><a class="header-anchor" href="#_8-4-选择排序" aria-hidden="true">#</a> 8.4 选择排序</h2>
<h3 id="简单选择排序" tabindex="-1"><a class="header-anchor" href="#简单选择排序" aria-hidden="true">#</a> 简单选择排序</h3>
<p>代码 TODO</p>
<h3 id="堆排序" tabindex="-1"><a class="header-anchor" href="#堆排序" aria-hidden="true">#</a> 堆排序</h3>
<p>可以分为 大根堆（大顶堆）和 小根堆（小根堆）</p>
<p>代码 TODO</p>
<!-- ### 习题

- 3
- 6
- 8 向具有 n 个关键字的堆中插入一个新元素的时间复杂度为多少？删除一个元素的时间复杂度为多少？→ 均为$O(\log_2n)$
- 9
- 12【2011】已知序列 `25 13 10 12 9` 是大根堆，在序列尾部插入新元素，将其再调整为大根堆，调整过程中元素之间进行的比较次数是 →2，第一次 18 与 10 比较，交换 18 和 1，第二次 18 与 25 比较，共两次
- 13
- 14【2015】已知小根堆为 `8 15 10 21 34 16 12` ，删除关键字 8 之后需重新建堆，再次过程中，关键字之间的比较次数是 →3 ，叶结点 12 变为根结点，重新构建堆，第一次 15 和 10 比较，第二次 12 和 10 比较，交换 10 和 12，第三次 12 和 16 比较
- 15【2018】
- 16【2020】 -->
</div></template>
